[
  {
    "q": "Why are no articles being delivered for my feed?",
    "a": "- Double check that the bot has permissions to read and send messages.\n- Ensure the all feed's articles are publicly accessible (for example, not in private forum sections)\n- Make sure any feed filters that you set are working as expected.\n- Wait at least 10 minutes for any new articles to be fetched, if there are any past the time of feed addition (which can be checked in a browser that beautifies the feed such as firefox, or a browser plugin).\n- Ensure your feed has the pubdate (published date) and `{date}` field in the `test` command filled out. If they don't exist, articles will be marked as old and won't be sent. You may bypass this by disabling date checks for a specific feed in `options`.\n- If date checks are turned on (which is default), make sure the `{date}`s are less than a day old.\n\nIf the issue still persists after **carefully reading the above points**, provide your server ID, feed URL, and what the expect article(s) were in the support server.",
    "t": [
      "missing",
      "articles",
      "feed",
      "no articles"
    ]
  },
  {
    "q": "Why am I getting articles with the same title?",
    "a": "The feed author may be improperly formatting the feed, causing two same articles to have the different unique identifiers (commonly guid) and thus classified as different articles. You may work around this by enabling title checks via the command `compare -title`.",
    "t": [
      "duplicate",
      "same title",
      "repeat"
    ]
  },
  {
    "q": "How do I move or add a feed to a channel?",
    "a": "Use the `add` command in your desired channel, or use the `move` command to move an existing feed to another channel.",
    "t": [
      "move",
      "channel",
      "different channel",
      "add"
    ]
  },
  {
    "q": "What is a valid RSS feed, and how do I find one?",
    "a": "A valid feed is normally a page with XML code. See https://rss.nytimes.com/services/xml/rss/nyt/HomePage.xml for an example of how an RSS page looks like. To find a feed, you can find an RSS icon or a link that alludes to getting updates. If you are still unable to find it, you can try contacting the site admin to see if they can provide the RSS feed you need.",
    "t": [
      "valid feed",
      "feed",
      "xml",
      "invalid",
      "find"
    ]
  },
  {
    "q": "How do I change the default embed?",
    "a": "The default embed is auto-generated by Discord. To use your own and replace the default embed, use the `embed` command.",
    "t": [
      "embed",
      "replace",
      "change",
      "default embed"
    ]
  },
  {
    "q": "How do I mention a user or role when a new article comes in?",
    "a": "To mention everyone, put the @everyone mention in your feed text through the `text` command. To mention a specific role or user, use the `mention` command for users and roles. **Make sure you use the `{subscribers}` placeholder since this is where the mentions are located.",
    "t": [
      "notify",
      "mention",
      "new",
      "ping",
      "role",
      "user"
    ]
  },
  {
    "q": "How do I restore an backup file?",
    "a": "If you're on the public bot, DM me your file. Otherwise, use the `restore` bot owner command.",
    "t": [
      "backup",
      "restore",
      "file",
      "json"
    ]
  },
  {
    "q": "What permissions are required for someone to use the bot?",
    "a": "Manage Channel permission in either Server Settings, or in a specific channel's settings. For the `sub` and `unsub` commands, no special permissions are required.",
    "t": [
      "permission",
      "command"
    ]
  },
  {
    "q": "How do I get higher feed limit or faster refresh rate?",
    "a": "You may get an official limit increase that supports customizations for each individual feed by supporting me on Patreon https://www.patreon.com/discordrss (would be greatly appreciated!).\n    \n    You may also use a feed aggregator to combine multiple feeds into one (this has some disadvantages, such as its own unknown refresh time separate from the bot's). The limit is there to prevent abuse, and to optimize retrieval times.",
    "t": [
      "feed limit",
      "increase",
      "refresh rate",
      "more feeds"
    ]
  },
  {
    "q": "Why is the bot sending empty messages whenever I use a command?",
    "a": "Your user settings are preventing you from seeing embeds. In your Discord User Settings, make sure you have the options \"Show website preview info from links pasted into chat\" and \"When posted as links to chat\" options enabled.",
    "t": [
      "empty",
      "command",
      "nothing"
    ]
  },
  {
    "q": "How do I give a custom name and avatar to the bot?",
    "a": "For a custom name, you can set its nickname by right click and change nickname.\n\nIf you want a custom avatar, this can only be done via webhooks (https://docs.discordrss.xyz/customizations/webhooks). For use of webhooks on the public bot, you will need to be a patron (https://www.patreon.com/discordrss).",
    "t": [
      "custom name",
      "custom avatar",
      "webhook"
    ]
  },
  {
    "q": "How do I get the content in a tag in the original XML feed source that is not available as a placeholder?",
    "a": "Use rssdump to get a list of all possible \"raw\" placeholders, and refer to them as `{raw:placeholder_name}` in your message or filters. Replace `placeholder_name` with the name in the rssdump file.",
    "t": [
      "rssdump",
      "raw placeholder",
      "xml",
      "source",
      "tag"
    ]
  },
  {
    "q": "How do I remove image links from a placeholder?",
    "a": "Disable image links existence in the `options` command.",
    "t": [
      "image",
      "hide",
      "remove"
    ]
  },
  {
    "q": "How do I add anchors or masked links to my message?",
    "a": "Masked links can only be added within embeds, wherever they are allowed. To create them within an embed, use the format: ```[Click Me!](https://www.google.com)``` where you put your text within the square brackets, and the link within the parentheses.",
    "t": [
      "masked link",
      "href",
      "anchor",
      "link"
    ]
  },
  {
    "q": "How do I get fewer articles delivered, or get slower delivery?",
    "a": "To get slower article delivery, you will have to self host and set the refresh rate in config to your needs.\n\nTo get fewer aticles delivered, you can set filters through the `filters` command to only get the content you want delivered.",
    "t": [
      "slow",
      "fewer",
      "rate",
      "less",
      "fast"
    ]
  },
  {
    "q": "Why are subscribers, roles, or users not being mentioned in articles?",
    "a": "Ensure the `{subscribers}` placeholder is placed somewhere in your text with the `text` command.\n\nIf you have filters attached to your subscribers, then the filters you set for them must pass for them to be mentioned. To have subscribers mentioned in every article, remove the filters with the `mention` command.",
    "t": [
      "subscribers",
      "no mention"
    ]
  },
  {
    "q": "What is the refresh rate of my feed, and how do I check it?",
    "a": "Use the `list` command.",
    "t": [
      "check",
      "status",
      "list"
    ]
  }
]
